<a href="https://colab.research.google.com/github/saiyanka/block/blob/master/zindua_(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
pip install mysql

Collecting mysql
  Downloading mysql-0.0.3-py3-none-any.whl (1.2 kB)
Collecting mysqlclient (from mysql)
  Downloading mysqlclient-2.2.4.tar.gz (90 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 90.4/90.4 kB 2.2 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Installing backend dependencies ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.4-cp310-cp310-linux_x86_64.whl size=124733 sha256=ef4e9fc9310437d0818dc5ae3d514579a79d4ef4c93df30df6bf2c144839c835
  Stored in directory: /root/.cache/pip/wheels/ac/96/ac/2a4d8cb58a4d95de1dffc3f8b0ea42e0e5b63ab97640edbda3
Successfully built mysqlclient
Installing collected packages: mysqlclient, mysql
Successfully installed mysql-0.0.3 mysqlclient-2.2.4

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///zindua.db

In [4]:
%%sql CREATE TABLE personal_details (
  national_ID INT(15) PRIMARY KEY,
  stud_ID VARCHAR(15),
  stud_name VARCHAR(100),
  phone_number VARCHAR(15),
  age INTEGER,
  gender VARCHAR(10)
 );

 * sqlite:///zindua.db
Done.

[]

In [5]:
%%sql INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

 * sqlite:///zindua.db
15 rows affected.

[]

In [6]:
%%sql CREATE TABLE school_details(
    stud_ID VARCHAR(15),
    current_home_county VARCHAR(20),
     secondary_school_county VARCHAR(20),
     residence VARCHAR(15),
     stud_email VARCHAR(50) PRIMARY KEY
      );

INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite:///zindua.db
Done.
15 rows affected.

[]

%%sql CREATE TABLE school_details(
    stud_ID VARCHAR(15),
    current_home_county VARCHAR(20),
    secondary_school_county VARCHAR(20),
    residence VARCHAR(15),
    stud_email  VARCHAR(50) PRIMARY KEY,
 );

In [7]:
%%sql UPDATE school_details
SET stud_email = (
    SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
    FROM personal_details
    WHERE school_details.stud_ID = personal_details.stud_ID
);

 * sqlite:///zindua.db
15 rows affected.

[]

In [8]:
%%sql CREATE TABLE contact_details (
    stud_email VARCHAR(50) ,
     phone_number VARCHAR(15),
      next_of_kin_name VARCHAR(50),
      next_of_kin_relation VARCHAR(10),
      next_of_kin_contacts VARCHAR(13) );

INSERT INTO contact_details(
  phone_number,
  next_of_kin_name,
  next_of_kin_relation,
  next_of_kin_contacts)
VALUES("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243"),
("0781234567","Cindy Wayne","Mother","0747282839"),
("0722345678","Farah Maalim","Mother","0753927482"),
("0733456781","Faiba Mbugua","Father","0713245748"),
("0744567812","John Doe","Father","0725737383"),
("0755678123","Klaus Michealson","Father","0789346276"),
("0766456781","Suluhu Amdany","Mother","0785739259"),
("0741367812","Daisy Auma","Mother","0791344537"),
("0755421123","Getrude Karen","Mother","0765748244");

 * sqlite:///zindua.db
Done.
15 rows affected.

[]

In [9]:
%%sql UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite:///zindua.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%%sql SELECT *FROM school_details

 * sqlite:///zindua.db
Done.

[('stud101', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac'),
 ('stud102', 'Nairobi', 'Nakuru', 'In school', 'DracoMalfo@zinduaschool.ac'),
 ('stud103', 'Samburu', 'Nairobi', 'Out of school', 'JaydenWamashati@zinduaschool.ac'),
 ('stud104', 'Kericho', 'Nairobi', 'In school', 'RonWeasley@zinduaschool.ac'),
 ('stud105', 'Nyamira', 'Nakuru', 'In school', 'DoloresUmbridge@zinduaschool.ac'),
 ('stud106', 'Kisumu', 'Nairobi', 'Out of school', 'HedwigTonks@zinduaschool.ac'),
 ('stud107', 'Nakuru', 'Nairobi', 'Out of school', 'ChaoChang@zinduaschool.ac'),
 ('stud108', 'Kisumu', 'Mombasa', 'Out of school', 'CurfewYaeitpm@zinduaschool.ac'),
 ('stud109', 'Kericho', 'Mombasa', 'In school', 'ChaptrMukenya@zinduaschool.ac'),
 ('stud110', 'Nakuru', 'Mombasa', 'In school', 'NatalieMpema@zinduaschool.ac'),
 ('stud111', 'Kiambu', 'Turkana', 'In school', 'CrewNundi@zinduaschool.ac'),
 ('stud112', 'Nairobi', 'Nakuru', 'In school', 'BandiKagunda@zinduaschool.ac'),
 ('stud113', 'Samburu', 'Taita Taveta', 'In school', 'TestimonyOmolo@zinduaschool.ac'),
 ('stud114', 'Kericho', 'Nairobi', 'Out of school', 'CareerMpya@zinduaschool.ac'),
 ('stud115', 'Kiambu', 'Mombasa', 'In school', 'DeamonAnduro@zinduaschool.ac')]

In [11]:
%%sql SELECT * FROM contact_details

 * sqlite:///zindua.db
Done.

[(None, '0712345678', 'Darius Young', 'Father', '0782382383'),
 (None, '0723456781', 'Lucy Nderitu', 'Mother', '0723238983'),
 (None, '0734567812', 'Jerotich Koech', 'Mother', '0779343126'),
 (None, '0745678123', 'Mwaura Mwangi', 'Father', '0798246347'),
 (None, '0756781234', 'Ian Patrick', 'Father', '0711234453'),
 (None, '0767812345', 'Lebron James', 'Father', '0765439233'),
 (None, '0778123456', 'Magna Carter', 'Father', '0702526243'),
 (None, '0781234567', 'Cindy Wayne', 'Mother', '0747282839'),
 (None, '0722345678', 'Farah Maalim', 'Mother', '0753927482'),
 (None, '0733456781', 'Faiba Mbugua', 'Father', '0713245748'),
 (None, '0744567812', 'John Doe', 'Father', '0725737383'),
 (None, '0755678123', 'Klaus Michealson', 'Father', '0789346276'),
 (None, '0766456781', 'Suluhu Amdany', 'Mother', '0785739259'),
 (None, '0741367812', 'Daisy Auma', 'Mother', '0791344537'),
 (None, '0755421123', 'Getrude Karen', 'Mother', '0765748244')]

In [12]:
%%sql CREATE TABLE financial_details (stud_ID VARCHAR(15) ,stud_name VARCHAR(50) ,
sem_fee INTEGER(6) , fee_paid INTEGER(6),
PRIMARY KEY(stud_ID) );

INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

 * sqlite:///zindua.db
Done.
15 rows affected.

[]

In [13]:
%%sql UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";


SET SQL_SAFE_UPDATES =1;

 * sqlite:///zindua.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET SQL_SAFE_UPDATES =1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [14]:
%%sql SELECT * FROM personal_details

 * sqlite:///zindua.db
Done.

[(344534, 'stud101', 'Hermione Granger', '0712345678', 20, 'Male'),
 (379683, 'stud102', 'Draco Malfo', '0723456781', 21, 'Female'),
 (347403, 'stud103', 'Jayden Wamashati', '0734567812', 22, 'Male'),
 (377302, 'stud104', 'Ron Weasley', '0745678123', 19, 'Female'),
 (336741, 'stud105', 'Dolores Umbridge', '0756781234', 21, 'Male'),
 (307243, 'stud106', 'Hedwig Tonks', '0767812345', 21, 'Female'),
 (310932, 'stud107', 'Chao Chang', '0778123456', 22, 'Male'),
 (343920, 'stud108', 'Curfew Yaeitpm', '0781234567', 20, 'Female'),
 (345261, 'stud109', 'Chaptr Mukenya', '0722345678', 20, 'Male'),
 (339152, 'stud110', 'Natalie Mpema', '0733456781', 21, 'Female'),
 (339746, 'stud111', 'Crew Nundi', '0744567812', 20, 'Male'),
 (336373, 'stud112', 'Bandi Kagunda', '0755678123', 22, 'Female'),
 (325252, 'stud113', 'Testimony Omolo', '0766456781', 21, 'Male'),
 (321746, 'stud114', 'Career Mpya', '0741367812', 20, 'Male'),
 (390234, 'stud115', 'Deamon Anduro', '0744421123', 22, 'Female')]

In [16]:
%%sql INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite:///zindua.db
15 rows affected.

[]

In [17]:
%%sql UPDATE school_details
SET stud_email = (
    SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
    FROM personal_details
    WHERE school_details.stud_ID = personal_details.stud_ID
);

 * sqlite:///zindua.db
(sqlite3.IntegrityError) UNIQUE constraint failed: school_details.stud_email
[SQL: UPDATE school_details
SET stud_email = (
    SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
    FROM personal_details
    WHERE school_details.stud_ID = personal_details.stud_ID
);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [18]:
%%sql SELECT * FROM school_details

 * sqlite:///zindua.db
Done.

[('stud101', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac'),
 ('stud102', 'Nairobi', 'Nakuru', 'In school', 'DracoMalfo@zinduaschool.ac'),
 ('stud103', 'Samburu', 'Nairobi', 'Out of school', 'JaydenWamashati@zinduaschool.ac'),
 ('stud104', 'Kericho', 'Nairobi', 'In school', 'RonWeasley@zinduaschool.ac'),
 ('stud105', 'Nyamira', 'Nakuru', 'In school', 'DoloresUmbridge@zinduaschool.ac'),
 ('stud106', 'Kisumu', 'Nairobi', 'Out of school', 'HedwigTonks@zinduaschool.ac'),
 ('stud107', 'Nakuru', 'Nairobi', 'Out of school', 'ChaoChang@zinduaschool.ac'),
 ('stud108', 'Kisumu', 'Mombasa', 'Out of school', 'CurfewYaeitpm@zinduaschool.ac'),
 ('stud109', 'Kericho', 'Mombasa', 'In school', 'ChaptrMukenya@zinduaschool.ac'),
 ('stud110', 'Nakuru', 'Mombasa', 'In school', 'NatalieMpema@zinduaschool.ac'),
 ('stud111', 'Kiambu', 'Turkana', 'In school', 'CrewNundi@zinduaschool.ac'),
 ('stud112', 'Nairobi', 'Nakuru', 'In school', 'BandiKagunda@zinduaschool.ac'),
 ('stud113', 'Samburu', 'Taita Taveta', 'In school', 'TestimonyOmolo@zinduaschool.ac'),
 ('stud114', 'Kericho', 'Nairobi', 'Out of school', 'CareerMpya@zinduaschool.ac'),
 ('stud115', 'Kiambu', 'Mombasa', 'In school', 'DeamonAnduro@zinduaschool.ac'),
 ('stud101', None, None, None, None),
 ('stud102', None, None, None, None),
 ('stud103', None, None, None, None),
 ('stud104', None, None, None, None),
 ('stud105', None, None, None, None),
 ('stud106', None, None, None, None),
 ('stud107', None, None, None, None),
 ('stud108', None, None, None, None),
 ('stud109', None, None, None, None),
 ('stud110', None, None, None, None),
 ('stud111', None, None, None, None),
 ('stud112', None, None, None, None),
 ('stud113', None, None, None, None),
 ('stud114', None, None, None, None),
 ('stud115', None, None, None, None)]

In [19]:
%%sql SELECT * FROM contact_details

 * sqlite:///zindua.db
Done.

[(None, '0712345678', 'Darius Young', 'Father', '0782382383'),
 (None, '0723456781', 'Lucy Nderitu', 'Mother', '0723238983'),
 (None, '0734567812', 'Jerotich Koech', 'Mother', '0779343126'),
 (None, '0745678123', 'Mwaura Mwangi', 'Father', '0798246347'),
 (None, '0756781234', 'Ian Patrick', 'Father', '0711234453'),
 (None, '0767812345', 'Lebron James', 'Father', '0765439233'),
 (None, '0778123456', 'Magna Carter', 'Father', '0702526243'),
 (None, '0781234567', 'Cindy Wayne', 'Mother', '0747282839'),
 (None, '0722345678', 'Farah Maalim', 'Mother', '0753927482'),
 (None, '0733456781', 'Faiba Mbugua', 'Father', '0713245748'),
 (None, '0744567812', 'John Doe', 'Father', '0725737383'),
 (None, '0755678123', 'Klaus Michealson', 'Father', '0789346276'),
 (None, '0766456781', 'Suluhu Amdany', 'Mother', '0785739259'),
 (None, '0741367812', 'Daisy Auma', 'Mother', '0791344537'),
 (None, '0755421123', 'Getrude Karen', 'Mother', '0765748244')]

In [20]:
%%sql SELECT * FROM financial_details

 * sqlite:///zindua.db
Done.

[('stud101', 'Hermione Granger', 25000, 25000),
 ('stud102', 'Draco Malfo', 25000, 19000),
 ('stud103', 'Jayden Wamashati', 21900, 20000),
 ('stud104', 'Ron Weasley', 22000, 22000),
 ('stud105', 'Dolores Umbridge', 25000, 23400),
 ('stud106', 'Hedwig Tonks', 25000, 27000),
 ('stud107', 'Chao Chang', 24230, 21200),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500),
 ('stud109', 'Chaptr Mukenya', 25000, 24500),
 ('stud110', 'Natalie Mpema', 25000, 25000),
 ('stud111', 'Crew Nundi', 26000, 26000),
 ('stud112', 'Bandi Kagunda', 25000, 20900),
 ('stud113', 'Testimony Omolo', 25000, 22300),
 ('stud114', 'Career Mpya', 19000, 19000),
 ('stud115', 'Deamon Anduro', 20800, 20800)]

In [32]:
%%sql UPDATE school_details
SET stud_email = (
    SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
    FROM personal_details
    WHERE school_details.stud_ID = personal_details.stud_ID
);

 * sqlite:///zindua.db
(sqlite3.IntegrityError) UNIQUE constraint failed: school_details.stud_email
[SQL: UPDATE school_details
SET stud_email = (
    SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
    FROM personal_details
    WHERE school_details.stud_ID = personal_details.stud_ID
);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

Using JOIN get the student names, school id, email, phone number (new_stud_details)

In [22]:
%%sql SELECT personal_details.stud_name, school_details.stud_ID, school_details.stud_email, personal_details.phone_number
FROM personal_details
JOIN school_details ON personal_details.stud_ID = school_details.stud_ID;

 * sqlite:///zindua.db
Done.

[('Hermione Granger', 'stud101', None, '0712345678'),
 ('Hermione Granger', 'stud101', 'HermioneGranger@zinduaschool.ac', '0712345678'),
 ('Draco Malfo', 'stud102', None, '0723456781'),
 ('Draco Malfo', 'stud102', 'DracoMalfo@zinduaschool.ac', '0723456781'),
 ('Jayden Wamashati', 'stud103', None, '0734567812'),
 ('Jayden Wamashati', 'stud103', 'JaydenWamashati@zinduaschool.ac', '0734567812'),
 ('Ron Weasley', 'stud104', None, '0745678123'),
 ('Ron Weasley', 'stud104', 'RonWeasley@zinduaschool.ac', '0745678123'),
 ('Dolores Umbridge', 'stud105', None, '0756781234'),
 ('Dolores Umbridge', 'stud105', 'DoloresUmbridge@zinduaschool.ac', '0756781234'),
 ('Hedwig Tonks', 'stud106', None, '0767812345'),
 ('Hedwig Tonks', 'stud106', 'HedwigTonks@zinduaschool.ac', '0767812345'),
 ('Chao Chang', 'stud107', None, '0778123456'),
 ('Chao Chang', 'stud107', 'ChaoChang@zinduaschool.ac', '0778123456'),
 ('Curfew Yaeitpm', 'stud108', None, '0781234567'),
 ('Curfew Yaeitpm', 'stud108', 'CurfewYaeitpm@zinduaschool.ac', '0781234567'),
 ('Chaptr Mukenya', 'stud109', None, '0722345678'),
 ('Chaptr Mukenya', 'stud109', 'ChaptrMukenya@zinduaschool.ac', '0722345678'),
 ('Natalie Mpema', 'stud110', None, '0733456781'),
 ('Natalie Mpema', 'stud110', 'NatalieMpema@zinduaschool.ac', '0733456781'),
 ('Crew Nundi', 'stud111', None, '0744567812'),
 ('Crew Nundi', 'stud111', 'CrewNundi@zinduaschool.ac', '0744567812'),
 ('Bandi Kagunda', 'stud112', None, '0755678123'),
 ('Bandi Kagunda', 'stud112', 'BandiKagunda@zinduaschool.ac', '0755678123'),
 ('Testimony Omolo', 'stud113', None, '0766456781'),
 ('Testimony Omolo', 'stud113', 'TestimonyOmolo@zinduaschool.ac', '0766456781'),
 ('Career Mpya', 'stud114', None, '0741367812'),
 ('Career Mpya', 'stud114', 'CareerMpya@zinduaschool.ac', '0741367812'),
 ('Deamon Anduro', 'stud115', None, '0744421123'),
 ('Deamon Anduro', 'stud115', 'DeamonAnduro@zinduaschool.ac', '0744421123')]

b. Create a table with all the details from contacts to school and financial details (full_stud_details)

In [23]:
%%sql CREATE TABLE full_stud_details AS
SELECT contact_details.stud_email, contact_details.phone_number, contact_details.next_of_kin_name, contact_details.next_of_kin_relation, contact_details.next_of_kin_contacts,
       school_details.current_home_county, school_details.secondary_school_county, school_details.residence,
       financial_details.sem_fee, financial_details.fee_paid
FROM contact_details
JOIN school_details ON contact_details.stud_email = school_details.stud_email
JOIN financial_details ON contact_details.stud_email = financial_details.stud_ID;

 * sqlite:///zindua.db
Done.

[]

In [24]:
%%sql SELECT * FROM full_stud_details

 * sqlite:///zindua.db
Done.

[]

c. Add student names on any empty row of stud_name in financial_details

In [25]:
%%sql UPDATE financial_details
SET stud_name = (SELECT stud_name FROM personal_details WHERE personal_details.stud_ID = financial_details.stud_ID)
WHERE stud_name IS NULL;

 * sqlite:///zindua.db
0 rows affected.

[]

d. On the financial_details table add a column, fee_cleared, that has True if student has cleared current fee and False if not (financial_details_view)

In [26]:
%%sql ALTER TABLE financial_details
ADD COLUMN fee_cleared BOOLEAN;

UPDATE financial_details
SET fee_cleared = CASE WHEN fee_paid = sem_fee THEN TRUE
ELSE FALSE
END;

 * sqlite:///zindua.db
Done.
15 rows affected.

[]

e. Get the national ID and name of all students who have cleared their fees (fee_cleared)

In [27]:
%%sql SELECT personal_details.national_ID, personal_details.stud_name
FROM personal_details
JOIN financial_details ON personal_details.stud_ID = financial_details.stud_ID
WHERE financial_details.fee_cleared = TRUE;

 * sqlite:///zindua.db
Done.

[(344534, 'Hermione Granger'),
 (377302, 'Ron Weasley'),
 (339152, 'Natalie Mpema'),
 (339746, 'Crew Nundi'),
 (321746, 'Career Mpya'),
 (390234, 'Deamon Anduro')]

f. Get the total sum of fees paid so far and the total current deficit (total_fee_balance)

In [28]:
%%sql SELECT SUM(fee_paid) AS total_fees_paid,
SUM(sem_fee - fee_paid) AS total_deficit
FROM financial_details;

 * sqlite:///zindua.db
Done.

[(339600, 19330)]

g. Get the count of students who share a current home county i.e., Say Nairobi, get the number of students who’s current_home_county is Nairobi, and so on for all available counties (home_county_count)

In [29]:
%%sql SELECT current_home_county, COUNT(*) AS student_count
FROM school_details
GROUP BY current_home_county;

 * sqlite:///zindua.db
Done.

[(None, 15),
 ('Kericho', 3),
 ('Kiambu', 2),
 ('Kisumu', 2),
 ('Nairobi', 2),
 ('Nakuru', 3),
 ('Nyamira', 1),
 ('Samburu', 2)]

h. Get the count of Male and/or Female students from each secondary_school_county (secondary_school_count). The table should contain a column for male student count and female student count for each county.

In [30]:
%%sql SELECT secondary_school_county,
       SUM(CASE WHEN gender = 'Male' THEN 1 ELSE 0 END) AS male_count,
       SUM(CASE WHEN gender = 'Female' THEN 1 ELSE 0 END) AS female_count
FROM personal_details
JOIN school_details ON personal_details.stud_ID = school_details.stud_ID
GROUP BY secondary_school_county;

 * sqlite:///zindua.db
Done.

[(None, 8, 7),
 ('Mombasa', 1, 3),
 ('Nairobi', 4, 2),
 ('Nakuru', 1, 2),
 ('Taita Taveta', 1, 0),
 ('Turkana', 1, 0)]

i. Get the percentage of students who set their next_of_kin as Mother vs those that set it as Father1. (kin_percentage)

In [31]:
%%sql SELECT next_of_kin_relation,
       (COUNT(*) / (SELECT COUNT(*) FROM contact_details)) * 100 AS percentage
FROM contact_details
GROUP BY next_of_kin_relation;

 * sqlite:///zindua.db
Done.

[('Father', 0), ('Mother', 0)]